{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "Sentiment_Model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_1_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 60], "dtype": "float32", "input_dim": 272836, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 60}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of27.bin", "group1-shard2of27.bin", "group1-shard3of27.bin", "group1-shard4of27.bin", "group1-shard5of27.bin", "group1-shard6of27.bin", "group1-shard7of27.bin", "group1-shard8of27.bin", "group1-shard9of27.bin", "group1-shard10of27.bin", "group1-shard11of27.bin", "group1-shard12of27.bin", "group1-shard13of27.bin", "group1-shard14of27.bin", "group1-shard15of27.bin", "group1-shard16of27.bin", "group1-shard17of27.bin", "group1-shard18of27.bin", "group1-shard19of27.bin", "group1-shard20of27.bin", "group1-shard21of27.bin", "group1-shard22of27.bin", "group1-shard23of27.bin", "group1-shard24of27.bin", "group1-shard25of27.bin", "group1-shard26of27.bin", "group1-shard27of27.bin"], "weights": [{"name": "bidirectional_2/forward_lstm_2/lstm_cell_1/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_1/bias", "shape": [400], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_2/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_2/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_2/bias", "shape": [400], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [5, 200, 100], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [100, 16], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [272836, 100], "dtype": "float32"}]}]}